MikroElektronika/core_packages/PIC/XC8/def/PIC12F1572/mcu.h
// Register: CWG1CON2
#define CWG1CON2 CWG1CON2
extern volatile unsigned char           CWG1CON2            __at(0x695);
#ifndef _LIB_BUILD
asm("CWG1CON2 equ 0695h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned G1ASDSFLT              :1;
        unsigned G1ASDSC1               :1;
        unsigned                        :3;
        unsigned G1ARSEN                :1;
        unsigned G1ASE                  :1;
    };
} CWG1CON2bits_t;
extern volatile CWG1CON2bits_t CWG1CON2bits __at(0x695);
// bitfield macros
#define _CWG1CON2_G1ASDSFLT_POSN                            0x1
#define _CWG1CON2_G1ASDSFLT_POSITION                        0x1
#define _CWG1CON2_G1ASDSFLT_SIZE                            0x1
#define _CWG1CON2_G1ASDSFLT_LENGTH                          0x1
#define _CWG1CON2_G1ASDSFLT_MASK                            0x2
#define _CWG1CON2_G1ASDSC1_POSN                             0x2
#define _CWG1CON2_G1ASDSC1_POSITION                         0x2
#define _CWG1CON2_G1ASDSC1_SIZE                             0x1
#define _CWG1CON2_G1ASDSC1_LENGTH                           0x1
#define _CWG1CON2_G1ASDSC1_MASK                             0x4
#define _CWG1CON2_G1ARSEN_POSN                              0x6
#define _CWG1CON2_G1ARSEN_POSITION                          0x6
#define _CWG1CON2_G1ARSEN_SIZE                              0x1
#define _CWG1CON2_G1ARSEN_LENGTH                            0x1
#define _CWG1CON2_G1ARSEN_MASK                              0x40
#define _CWG1CON2_G1ASE_POSN                                0x7
#define _CWG1CON2_G1ASE_POSITION                            0x7
#define _CWG1CON2_G1ASE_SIZE                                0x1
#define _CWG1CON2_G1ASE_LENGTH                              0x1
#define _CWG1CON2_G1ASE_MASK                                0x80

// Register: PWMEN
#define PWMEN PWMEN
extern volatile unsigned char           PWMEN               __at(0xD8E);
#ifndef _LIB_BUILD
asm("PWMEN equ 0D8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM1EN_A               :1;
        unsigned PWM2EN_A               :1;
        unsigned PWM3EN_A               :1;
    };
    struct {
        unsigned MPWM1EN                :1;
        unsigned MPWM2EN                :1;
        unsigned MPWM3EN                :1;
    };
} PWMENbits_t;
extern volatile PWMENbits_t PWMENbits __at(0xD8E);
// bitfield macros
#define _PWMEN_PWM1EN_A_POSN                                0x0
#define _PWMEN_PWM1EN_A_POSITION                            0x0
#define _PWMEN_PWM1EN_A_SIZE                                0x1
#define _PWMEN_PWM1EN_A_LENGTH                              0x1
#define _PWMEN_PWM1EN_A_MASK                                0x1
#define _PWMEN_PWM2EN_A_POSN                                0x1
#define _PWMEN_PWM2EN_A_POSITION                            0x1
#define _PWMEN_PWM2EN_A_SIZE                                0x1
#define _PWMEN_PWM2EN_A_LENGTH                              0x1
#define _PWMEN_PWM2EN_A_MASK                                0x2
#define _PWMEN_PWM3EN_A_POSN                                0x2
#define _PWMEN_PWM3EN_A_POSITION                            0x2
#define _PWMEN_PWM3EN_A_SIZE                                0x1
#define _PWMEN_PWM3EN_A_LENGTH                              0x1
#define _PWMEN_PWM3EN_A_MASK                                0x4
#define _PWMEN_MPWM1EN_POSN                                 0x0
#define _PWMEN_MPWM1EN_POSITION                             0x0
#define _PWMEN_MPWM1EN_SIZE                                 0x1
#define _PWMEN_MPWM1EN_LENGTH                               0x1
#define _PWMEN_MPWM1EN_MASK                                 0x1
#define _PWMEN_MPWM2EN_POSN                                 0x1
#define _PWMEN_MPWM2EN_POSITION                             0x1
#define _PWMEN_MPWM2EN_SIZE                                 0x1
#define _PWMEN_MPWM2EN_LENGTH                               0x1
#define _PWMEN_MPWM2EN_MASK                                 0x2
#define _PWMEN_MPWM3EN_POSN                                 0x2
#define _PWMEN_MPWM3EN_POSITION                             0x2
#define _PWMEN_MPWM3EN_SIZE                                 0x1
#define _PWMEN_MPWM3EN_LENGTH                               0x1
#define _PWMEN_MPWM3EN_MASK                                 0x4

// Register: PWMLD
#define PWMLD PWMLD
extern volatile unsigned char           PWMLD               __at(0xD8F);
#ifndef _LIB_BUILD
asm("PWMLD equ 0D8Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM1LDA_A              :1;
        unsigned PWM2LDA_A              :1;
        unsigned PWM3LDA_A              :1;
    };
    struct {
        unsigned MPWM1LD                :1;
        unsigned MPWM2LD                :1;
        unsigned MPWM3LD                :1;
    };
} PWMLDbits_t;
extern volatile PWMLDbits_t PWMLDbits __at(0xD8F);
// bitfield macros
#define _PWMLD_PWM1LDA_A_POSN                               0x0
#define _PWMLD_PWM1LDA_A_POSITION                           0x0
#define _PWMLD_PWM1LDA_A_SIZE                               0x1
#define _PWMLD_PWM1LDA_A_LENGTH                             0x1
#define _PWMLD_PWM1LDA_A_MASK                               0x1
#define _PWMLD_PWM2LDA_A_POSN                               0x1
#define _PWMLD_PWM2LDA_A_POSITION                           0x1
#define _PWMLD_PWM2LDA_A_SIZE                               0x1
#define _PWMLD_PWM2LDA_A_LENGTH                             0x1
#define _PWMLD_PWM2LDA_A_MASK                               0x2
#define _PWMLD_PWM3LDA_A_POSN                               0x2
#define _PWMLD_PWM3LDA_A_POSITION                           0x2
#define _PWMLD_PWM3LDA_A_SIZE                               0x1
#define _PWMLD_PWM3LDA_A_LENGTH                             0x1
#define _PWMLD_PWM3LDA_A_MASK                               0x4
#define _PWMLD_MPWM1LD_POSN                                 0x0
#define _PWMLD_MPWM1LD_POSITION                             0x0
#define _PWMLD_MPWM1LD_SIZE                                 0x1
#define _PWMLD_MPWM1LD_LENGTH                               0x1
#define _PWMLD_MPWM1LD_MASK                                 0x1
#define _PWMLD_MPWM2LD_POSN                                 0x1
#define _PWMLD_MPWM2LD_POSITION                             0x1
#define _PWMLD_MPWM2LD_SIZE                                 0x1
#define _PWMLD_MPWM2LD_LENGTH                               0x1
#define _PWMLD_MPWM2LD_MASK                                 0x2
#define _PWMLD_MPWM3LD_POSN                                 0x2
#define _PWMLD_MPWM3LD_POSITION                             0x2
#define _PWMLD_MPWM3LD_SIZE                                 0x1
#define _PWMLD_MPWM3LD_LENGTH                               0x1
#define _PWMLD_MPWM3LD_MASK                                 0x4

// Register: PWMOUT
#define PWMOUT PWMOUT
extern volatile unsigned char           PWMOUT              __at(0xD90);
#ifndef _LIB_BUILD
asm("PWMOUT equ 0D90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM1OUT_A              :1;
        unsigned PWM2OUT_A              :1;
        unsigned PWM3OUT_A              :1;
    };
    struct {
        unsigned MPWM1OUT               :1;
        unsigned MPWM2OUT               :1;
        unsigned MPWM3OUT               :1;
    };
} PWMOUTbits_t;
extern volatile PWMOUTbits_t PWMOUTbits __at(0xD90);
// bitfield macros
#define _PWMOUT_PWM1OUT_A_POSN                              0x0
#define _PWMOUT_PWM1OUT_A_POSITION                          0x0
#define _PWMOUT_PWM1OUT_A_SIZE                              0x1
#define _PWMOUT_PWM1OUT_A_LENGTH                            0x1
#define _PWMOUT_PWM1OUT_A_MASK                              0x1
#define _PWMOUT_PWM2OUT_A_POSN                              0x1
#define _PWMOUT_PWM2OUT_A_POSITION                          0x1
#define _PWMOUT_PWM2OUT_A_SIZE                              0x1
#define _PWMOUT_PWM2OUT_A_LENGTH                            0x1
#define _PWMOUT_PWM2OUT_A_MASK                              0x2
#define _PWMOUT_PWM3OUT_A_POSN                              0x2
#define _PWMOUT_PWM3OUT_A_POSITION                          0x2
#define _PWMOUT_PWM3OUT_A_SIZE                              0x1
#define _PWMOUT_PWM3OUT_A_LENGTH                            0x1
#define _PWMOUT_PWM3OUT_A_MASK                              0x4
#define _PWMOUT_MPWM1OUT_POSN                               0x0
#define _PWMOUT_MPWM1OUT_POSITION                           0x0
#define _PWMOUT_MPWM1OUT_SIZE                               0x1
#define _PWMOUT_MPWM1OUT_LENGTH                             0x1
#define _PWMOUT_MPWM1OUT_MASK                               0x1
#define _PWMOUT_MPWM2OUT_POSN                               0x1
#define _PWMOUT_MPWM2OUT_POSITION                           0x1
#define _PWMOUT_MPWM2OUT_SIZE                               0x1
#define _PWMOUT_MPWM2OUT_LENGTH                             0x1
#define _PWMOUT_MPWM2OUT_MASK                               0x2
#define _PWMOUT_MPWM3OUT_POSN                               0x2
#define _PWMOUT_MPWM3OUT_POSITION                           0x2
#define _PWMOUT_MPWM3OUT_SIZE                               0x1
#define _PWMOUT_MPWM3OUT_LENGTH                             0x1
#define _PWMOUT_MPWM3OUT_MASK                               0x4

// Register: PWM1PH
#define PWM1PH PWM1PH
extern volatile unsigned short          PWM1PH              __at(0xD91);
#ifndef _LIB_BUILD
asm("PWM1PH equ 0D91h");
#endif

