MikroElektronika/core_packages/PIC/XC8/def/PIC12F1572/mcu.h
// Register: PWM2OFH
#define PWM2OFH PWM2OFH
extern volatile unsigned char           PWM2OFH             __at(0xDA8);
#ifndef _LIB_BUILD
asm("PWM2OFH equ 0DA8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM2OFH0               :1;
        unsigned PWM2OFH1               :1;
        unsigned PWM2OFH2               :1;
        unsigned PWM2OFH3               :1;
        unsigned PWM2OFH4               :1;
        unsigned PWM2OFH5               :1;
        unsigned PWM2OFH6               :1;
        unsigned PWM2OFH7               :1;
    };
    struct {
        unsigned PWM2OFH                :8;
    };
} PWM2OFHbits_t;
extern volatile PWM2OFHbits_t PWM2OFHbits __at(0xDA8);
// bitfield macros
#define _PWM2OFH_OF_POSN                                    0x0
#define _PWM2OFH_OF_POSITION                                0x0
#define _PWM2OFH_OF_SIZE                                    0x8
#define _PWM2OFH_OF_LENGTH                                  0x8
#define _PWM2OFH_OF_MASK                                    0xFF
#define _PWM2OFH_PWM2OFH0_POSN                              0x0
#define _PWM2OFH_PWM2OFH0_POSITION                          0x0
#define _PWM2OFH_PWM2OFH0_SIZE                              0x1
#define _PWM2OFH_PWM2OFH0_LENGTH                            0x1
#define _PWM2OFH_PWM2OFH0_MASK                              0x1
#define _PWM2OFH_PWM2OFH1_POSN                              0x1
#define _PWM2OFH_PWM2OFH1_POSITION                          0x1
#define _PWM2OFH_PWM2OFH1_SIZE                              0x1
#define _PWM2OFH_PWM2OFH1_LENGTH                            0x1
#define _PWM2OFH_PWM2OFH1_MASK                              0x2
#define _PWM2OFH_PWM2OFH2_POSN                              0x2
#define _PWM2OFH_PWM2OFH2_POSITION                          0x2
#define _PWM2OFH_PWM2OFH2_SIZE                              0x1
#define _PWM2OFH_PWM2OFH2_LENGTH                            0x1
#define _PWM2OFH_PWM2OFH2_MASK                              0x4
#define _PWM2OFH_PWM2OFH3_POSN                              0x3
#define _PWM2OFH_PWM2OFH3_POSITION                          0x3
#define _PWM2OFH_PWM2OFH3_SIZE                              0x1
#define _PWM2OFH_PWM2OFH3_LENGTH                            0x1
#define _PWM2OFH_PWM2OFH3_MASK                              0x8
#define _PWM2OFH_PWM2OFH4_POSN                              0x4
#define _PWM2OFH_PWM2OFH4_POSITION                          0x4
#define _PWM2OFH_PWM2OFH4_SIZE                              0x1
#define _PWM2OFH_PWM2OFH4_LENGTH                            0x1
#define _PWM2OFH_PWM2OFH4_MASK                              0x10
#define _PWM2OFH_PWM2OFH5_POSN                              0x5
#define _PWM2OFH_PWM2OFH5_POSITION                          0x5
#define _PWM2OFH_PWM2OFH5_SIZE                              0x1
#define _PWM2OFH_PWM2OFH5_LENGTH                            0x1
#define _PWM2OFH_PWM2OFH5_MASK                              0x20
#define _PWM2OFH_PWM2OFH6_POSN                              0x6
#define _PWM2OFH_PWM2OFH6_POSITION                          0x6
#define _PWM2OFH_PWM2OFH6_SIZE                              0x1
#define _PWM2OFH_PWM2OFH6_LENGTH                            0x1
#define _PWM2OFH_PWM2OFH6_MASK                              0x40
#define _PWM2OFH_PWM2OFH7_POSN                              0x7
#define _PWM2OFH_PWM2OFH7_POSITION                          0x7
#define _PWM2OFH_PWM2OFH7_SIZE                              0x1
#define _PWM2OFH_PWM2OFH7_LENGTH                            0x1
#define _PWM2OFH_PWM2OFH7_MASK                              0x80
#define _PWM2OFH_PWM2OFH_POSN                               0x0
#define _PWM2OFH_PWM2OFH_POSITION                           0x0
#define _PWM2OFH_PWM2OFH_SIZE                               0x8
#define _PWM2OFH_PWM2OFH_LENGTH                             0x8
#define _PWM2OFH_PWM2OFH_MASK                               0xFF

// Register: PWM2TMR
#define PWM2TMR PWM2TMR
extern volatile unsigned short          PWM2TMR             __at(0xDA9);
#ifndef _LIB_BUILD
asm("PWM2TMR equ 0DA9h");
#endif

// Register: PWM2TMRL
#define PWM2TMRL PWM2TMRL
extern volatile unsigned char           PWM2TMRL            __at(0xDA9);
#ifndef _LIB_BUILD
asm("PWM2TMRL equ 0DA9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM2TMRL0              :1;
        unsigned PWM2TMRL1              :1;
        unsigned PWM2TMRL2              :1;
        unsigned PWM2TMRL3              :1;
        unsigned PWM2TMRL4              :1;
        unsigned PWM2TMRL5              :1;
        unsigned PWM2TMRL6              :1;
        unsigned PWM2TMRL7              :1;
    };
    struct {
        unsigned PWM2TMRL               :8;
    };
} PWM2TMRLbits_t;
extern volatile PWM2TMRLbits_t PWM2TMRLbits __at(0xDA9);
// bitfield macros
#define _PWM2TMRL_TMR_POSN                                  0x0
#define _PWM2TMRL_TMR_POSITION                              0x0
#define _PWM2TMRL_TMR_SIZE                                  0x8
#define _PWM2TMRL_TMR_LENGTH                                0x8
#define _PWM2TMRL_TMR_MASK                                  0xFF
#define _PWM2TMRL_PWM2TMRL0_POSN                            0x0
#define _PWM2TMRL_PWM2TMRL0_POSITION                        0x0
#define _PWM2TMRL_PWM2TMRL0_SIZE                            0x1
#define _PWM2TMRL_PWM2TMRL0_LENGTH                          0x1
#define _PWM2TMRL_PWM2TMRL0_MASK                            0x1
#define _PWM2TMRL_PWM2TMRL1_POSN                            0x1
#define _PWM2TMRL_PWM2TMRL1_POSITION                        0x1
#define _PWM2TMRL_PWM2TMRL1_SIZE                            0x1
#define _PWM2TMRL_PWM2TMRL1_LENGTH                          0x1
#define _PWM2TMRL_PWM2TMRL1_MASK                            0x2
#define _PWM2TMRL_PWM2TMRL2_POSN                            0x2
#define _PWM2TMRL_PWM2TMRL2_POSITION                        0x2
#define _PWM2TMRL_PWM2TMRL2_SIZE                            0x1
#define _PWM2TMRL_PWM2TMRL2_LENGTH                          0x1
#define _PWM2TMRL_PWM2TMRL2_MASK                            0x4
#define _PWM2TMRL_PWM2TMRL3_POSN                            0x3
#define _PWM2TMRL_PWM2TMRL3_POSITION                        0x3
#define _PWM2TMRL_PWM2TMRL3_SIZE                            0x1
#define _PWM2TMRL_PWM2TMRL3_LENGTH                          0x1
#define _PWM2TMRL_PWM2TMRL3_MASK                            0x8
#define _PWM2TMRL_PWM2TMRL4_POSN                            0x4
#define _PWM2TMRL_PWM2TMRL4_POSITION                        0x4
#define _PWM2TMRL_PWM2TMRL4_SIZE                            0x1
#define _PWM2TMRL_PWM2TMRL4_LENGTH                          0x1
#define _PWM2TMRL_PWM2TMRL4_MASK                            0x10
#define _PWM2TMRL_PWM2TMRL5_POSN                            0x5
#define _PWM2TMRL_PWM2TMRL5_POSITION                        0x5
#define _PWM2TMRL_PWM2TMRL5_SIZE                            0x1
#define _PWM2TMRL_PWM2TMRL5_LENGTH                          0x1
#define _PWM2TMRL_PWM2TMRL5_MASK                            0x20
#define _PWM2TMRL_PWM2TMRL6_POSN                            0x6
#define _PWM2TMRL_PWM2TMRL6_POSITION                        0x6
#define _PWM2TMRL_PWM2TMRL6_SIZE                            0x1
#define _PWM2TMRL_PWM2TMRL6_LENGTH                          0x1
#define _PWM2TMRL_PWM2TMRL6_MASK                            0x40
#define _PWM2TMRL_PWM2TMRL7_POSN                            0x7
#define _PWM2TMRL_PWM2TMRL7_POSITION                        0x7
#define _PWM2TMRL_PWM2TMRL7_SIZE                            0x1
#define _PWM2TMRL_PWM2TMRL7_LENGTH                          0x1
#define _PWM2TMRL_PWM2TMRL7_MASK                            0x80
#define _PWM2TMRL_PWM2TMRL_POSN                             0x0
#define _PWM2TMRL_PWM2TMRL_POSITION                         0x0
#define _PWM2TMRL_PWM2TMRL_SIZE                             0x8
#define _PWM2TMRL_PWM2TMRL_LENGTH                           0x8
#define _PWM2TMRL_PWM2TMRL_MASK                             0xFF

// Register: PWM2TMRH
#define PWM2TMRH PWM2TMRH
extern volatile unsigned char           PWM2TMRH            __at(0xDAA);
#ifndef _LIB_BUILD
asm("PWM2TMRH equ 0DAAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned PWM2TMRH0              :1;
        unsigned PWM2TMRH1              :1;
        unsigned PWM2TMRH2              :1;
        unsigned PWM2TMRH3              :1;
        unsigned PWM2TMRH4              :1;
        unsigned PWM2TMRH5              :1;
        unsigned PWM2TMRH6              :1;
        unsigned PWM2TMRH7              :1;
    };
    struct {
        unsigned PWM2TMRH               :8;
    };
} PWM2TMRHbits_t;
extern volatile PWM2TMRHbits_t PWM2TMRHbits __at(0xDAA);
// bitfield macros
#define _PWM2TMRH_TMR_POSN                                  0x0
#define _PWM2TMRH_TMR_POSITION                              0x0
#define _PWM2TMRH_TMR_SIZE                                  0x8
#define _PWM2TMRH_TMR_LENGTH                                0x8
#define _PWM2TMRH_TMR_MASK                                  0xFF
#define _PWM2TMRH_PWM2TMRH0_POSN                            0x0
#define _PWM2TMRH_PWM2TMRH0_POSITION                        0x0
#define _PWM2TMRH_PWM2TMRH0_SIZE                            0x1
#define _PWM2TMRH_PWM2TMRH0_LENGTH                          0x1
#define _PWM2TMRH_PWM2TMRH0_MASK                            0x1
#define _PWM2TMRH_PWM2TMRH1_POSN                            0x1
#define _PWM2TMRH_PWM2TMRH1_POSITION                        0x1
#define _PWM2TMRH_PWM2TMRH1_SIZE                            0x1
#define _PWM2TMRH_PWM2TMRH1_LENGTH                          0x1
#define _PWM2TMRH_PWM2TMRH1_MASK                            0x2
#define _PWM2TMRH_PWM2TMRH2_POSN                            0x2
#define _PWM2TMRH_PWM2TMRH2_POSITION                        0x2
#define _PWM2TMRH_PWM2TMRH2_SIZE                            0x1
#define _PWM2TMRH_PWM2TMRH2_LENGTH                          0x1
#define _PWM2TMRH_PWM2TMRH2_MASK                            0x4
#define _PWM2TMRH_PWM2TMRH3_POSN                            0x3
#define _PWM2TMRH_PWM2TMRH3_POSITION                        0x3
#define _PWM2TMRH_PWM2TMRH3_SIZE                            0x1
#define _PWM2TMRH_PWM2TMRH3_LENGTH                          0x1
#define _PWM2TMRH_PWM2TMRH3_MASK                            0x8
#define _PWM2TMRH_PWM2TMRH4_POSN                            0x4
#define _PWM2TMRH_PWM2TMRH4_POSITION                        0x4
#define _PWM2TMRH_PWM2TMRH4_SIZE                            0x1
#define _PWM2TMRH_PWM2TMRH4_LENGTH                          0x1
#define _PWM2TMRH_PWM2TMRH4_MASK                            0x10
#define _PWM2TMRH_PWM2TMRH5_POSN                            0x5
#define _PWM2TMRH_PWM2TMRH5_POSITION                        0x5
#define _PWM2TMRH_PWM2TMRH5_SIZE                            0x1
#define _PWM2TMRH_PWM2TMRH5_LENGTH                          0x1
#define _PWM2TMRH_PWM2TMRH5_MASK                            0x20
#define _PWM2TMRH_PWM2TMRH6_POSN                            0x6
#define _PWM2TMRH_PWM2TMRH6_POSITION                        0x6
#define _PWM2TMRH_PWM2TMRH6_SIZE                            0x1
#define _PWM2TMRH_PWM2TMRH6_LENGTH                          0x1
#define _PWM2TMRH_PWM2TMRH6_MASK                            0x40
#define _PWM2TMRH_PWM2TMRH7_POSN                            0x7
#define _PWM2TMRH_PWM2TMRH7_POSITION                        0x7
#define _PWM2TMRH_PWM2TMRH7_SIZE                            0x1
#define _PWM2TMRH_PWM2TMRH7_LENGTH                          0x1
#define _PWM2TMRH_PWM2TMRH7_MASK                            0x80
#define _PWM2TMRH_PWM2TMRH_POSN                             0x0
#define _PWM2TMRH_PWM2TMRH_POSITION                         0x0
#define _PWM2TMRH_PWM2TMRH_SIZE                             0x8
#define _PWM2TMRH_PWM2TMRH_LENGTH                           0x8
#define _PWM2TMRH_PWM2TMRH_MASK                             0xFF

