MikroElektronika/core_packages/PIC/XC8/def/PIC12F1572/mcu.h
// Register: PWM3OFL
#define PWM3OFL PWM3OFL
extern volatile unsigned char           PWM3OFL             __at(0xDB7);
#ifndef _LIB_BUILD
asm("PWM3OFL equ 0DB7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM3OFL0               :1;
        unsigned PWM3OFL1               :1;
        unsigned PWM3OFL2               :1;
        unsigned PWM3OFL3               :1;
        unsigned PWM3OFL4               :1;
        unsigned PWM3OFL5               :1;
        unsigned PWM3OFL6               :1;
        unsigned PWM3OFL7               :1;
    };
    struct {
        unsigned PWM3OFL                :8;
    };
} PWM3OFLbits_t;
extern volatile PWM3OFLbits_t PWM3OFLbits __at(0xDB7);
// bitfield macros
#define _PWM3OFL_OF_POSN                                    0x0
#define _PWM3OFL_OF_POSITION                                0x0
#define _PWM3OFL_OF_SIZE                                    0x8
#define _PWM3OFL_OF_LENGTH                                  0x8
#define _PWM3OFL_OF_MASK                                    0xFF
#define _PWM3OFL_PWM3OFL0_POSN                              0x0
#define _PWM3OFL_PWM3OFL0_POSITION                          0x0
#define _PWM3OFL_PWM3OFL0_SIZE                              0x1
#define _PWM3OFL_PWM3OFL0_LENGTH                            0x1
#define _PWM3OFL_PWM3OFL0_MASK                              0x1
#define _PWM3OFL_PWM3OFL1_POSN                              0x1
#define _PWM3OFL_PWM3OFL1_POSITION                          0x1
#define _PWM3OFL_PWM3OFL1_SIZE                              0x1
#define _PWM3OFL_PWM3OFL1_LENGTH                            0x1
#define _PWM3OFL_PWM3OFL1_MASK                              0x2
#define _PWM3OFL_PWM3OFL2_POSN                              0x2
#define _PWM3OFL_PWM3OFL2_POSITION                          0x2
#define _PWM3OFL_PWM3OFL2_SIZE                              0x1
#define _PWM3OFL_PWM3OFL2_LENGTH                            0x1
#define _PWM3OFL_PWM3OFL2_MASK                              0x4
#define _PWM3OFL_PWM3OFL3_POSN                              0x3
#define _PWM3OFL_PWM3OFL3_POSITION                          0x3
#define _PWM3OFL_PWM3OFL3_SIZE                              0x1
#define _PWM3OFL_PWM3OFL3_LENGTH                            0x1
#define _PWM3OFL_PWM3OFL3_MASK                              0x8
#define _PWM3OFL_PWM3OFL4_POSN                              0x4
#define _PWM3OFL_PWM3OFL4_POSITION                          0x4
#define _PWM3OFL_PWM3OFL4_SIZE                              0x1
#define _PWM3OFL_PWM3OFL4_LENGTH                            0x1
#define _PWM3OFL_PWM3OFL4_MASK                              0x10
#define _PWM3OFL_PWM3OFL5_POSN                              0x5
#define _PWM3OFL_PWM3OFL5_POSITION                          0x5
#define _PWM3OFL_PWM3OFL5_SIZE                              0x1
#define _PWM3OFL_PWM3OFL5_LENGTH                            0x1
#define _PWM3OFL_PWM3OFL5_MASK                              0x20
#define _PWM3OFL_PWM3OFL6_POSN                              0x6
#define _PWM3OFL_PWM3OFL6_POSITION                          0x6
#define _PWM3OFL_PWM3OFL6_SIZE                              0x1
#define _PWM3OFL_PWM3OFL6_LENGTH                            0x1
#define _PWM3OFL_PWM3OFL6_MASK                              0x40
#define _PWM3OFL_PWM3OFL7_POSN                              0x7
#define _PWM3OFL_PWM3OFL7_POSITION                          0x7
#define _PWM3OFL_PWM3OFL7_SIZE                              0x1
#define _PWM3OFL_PWM3OFL7_LENGTH                            0x1
#define _PWM3OFL_PWM3OFL7_MASK                              0x80
#define _PWM3OFL_PWM3OFL_POSN                               0x0
#define _PWM3OFL_PWM3OFL_POSITION                           0x0
#define _PWM3OFL_PWM3OFL_SIZE                               0x8
#define _PWM3OFL_PWM3OFL_LENGTH                             0x8
#define _PWM3OFL_PWM3OFL_MASK                               0xFF

// Register: PWM3OFH
#define PWM3OFH PWM3OFH
extern volatile unsigned char           PWM3OFH             __at(0xDB8);
#ifndef _LIB_BUILD
asm("PWM3OFH equ 0DB8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM3OFH0               :1;
        unsigned PWM3OFH1               :1;
        unsigned PWM3OFH2               :1;
        unsigned PWM3OFH3               :1;
        unsigned PWM3OFH4               :1;
        unsigned PWM3OFH5               :1;
        unsigned PWM3OFH6               :1;
        unsigned PWM3OFH7               :1;
    };
    struct {
        unsigned PWM3OFH                :8;
    };
} PWM3OFHbits_t;
extern volatile PWM3OFHbits_t PWM3OFHbits __at(0xDB8);
// bitfield macros
#define _PWM3OFH_OF_POSN                                    0x0
#define _PWM3OFH_OF_POSITION                                0x0
#define _PWM3OFH_OF_SIZE                                    0x8
#define _PWM3OFH_OF_LENGTH                                  0x8
#define _PWM3OFH_OF_MASK                                    0xFF
#define _PWM3OFH_PWM3OFH0_POSN                              0x0
#define _PWM3OFH_PWM3OFH0_POSITION                          0x0
#define _PWM3OFH_PWM3OFH0_SIZE                              0x1
#define _PWM3OFH_PWM3OFH0_LENGTH                            0x1
#define _PWM3OFH_PWM3OFH0_MASK                              0x1
#define _PWM3OFH_PWM3OFH1_POSN                              0x1
#define _PWM3OFH_PWM3OFH1_POSITION                          0x1
#define _PWM3OFH_PWM3OFH1_SIZE                              0x1
#define _PWM3OFH_PWM3OFH1_LENGTH                            0x1
#define _PWM3OFH_PWM3OFH1_MASK                              0x2
#define _PWM3OFH_PWM3OFH2_POSN                              0x2
#define _PWM3OFH_PWM3OFH2_POSITION                          0x2
#define _PWM3OFH_PWM3OFH2_SIZE                              0x1
#define _PWM3OFH_PWM3OFH2_LENGTH                            0x1
#define _PWM3OFH_PWM3OFH2_MASK                              0x4
#define _PWM3OFH_PWM3OFH3_POSN                              0x3
#define _PWM3OFH_PWM3OFH3_POSITION                          0x3
#define _PWM3OFH_PWM3OFH3_SIZE                              0x1
#define _PWM3OFH_PWM3OFH3_LENGTH                            0x1
#define _PWM3OFH_PWM3OFH3_MASK                              0x8
#define _PWM3OFH_PWM3OFH4_POSN                              0x4
#define _PWM3OFH_PWM3OFH4_POSITION                          0x4
#define _PWM3OFH_PWM3OFH4_SIZE                              0x1
#define _PWM3OFH_PWM3OFH4_LENGTH                            0x1
#define _PWM3OFH_PWM3OFH4_MASK                              0x10
#define _PWM3OFH_PWM3OFH5_POSN                              0x5
#define _PWM3OFH_PWM3OFH5_POSITION                          0x5
#define _PWM3OFH_PWM3OFH5_SIZE                              0x1
#define _PWM3OFH_PWM3OFH5_LENGTH                            0x1
#define _PWM3OFH_PWM3OFH5_MASK                              0x20
#define _PWM3OFH_PWM3OFH6_POSN                              0x6
#define _PWM3OFH_PWM3OFH6_POSITION                          0x6
#define _PWM3OFH_PWM3OFH6_SIZE                              0x1
#define _PWM3OFH_PWM3OFH6_LENGTH                            0x1
#define _PWM3OFH_PWM3OFH6_MASK                              0x40
#define _PWM3OFH_PWM3OFH7_POSN                              0x7
#define _PWM3OFH_PWM3OFH7_POSITION                          0x7
#define _PWM3OFH_PWM3OFH7_SIZE                              0x1
#define _PWM3OFH_PWM3OFH7_LENGTH                            0x1
#define _PWM3OFH_PWM3OFH7_MASK                              0x80
#define _PWM3OFH_PWM3OFH_POSN                               0x0
#define _PWM3OFH_PWM3OFH_POSITION                           0x0
#define _PWM3OFH_PWM3OFH_SIZE                               0x8
#define _PWM3OFH_PWM3OFH_LENGTH                             0x8
#define _PWM3OFH_PWM3OFH_MASK                               0xFF

// Register: PWM3TMR
#define PWM3TMR PWM3TMR
extern volatile unsigned short          PWM3TMR             __at(0xDB9);
#ifndef _LIB_BUILD
asm("PWM3TMR equ 0DB9h");
#endif

